app/controllers/abo_newsletters_controller.rb

  def index
    @abo_newsletters = AboNewsletter.all
---
SELECT `abo_newsletters`.* FROM `abo_newsletters`

  def create
    @abo_newsletter = AboNewsletter.new(abo_newsletter_params)
    @abo_newsletter.enable = false

    respond_to do |format|
      if @abo_newsletter.save
---
INSERT INTO `abo_newsletters` (`eMail`, `enable`, `created_at`, `updated_at`) VALUES ('m-vennewald@web.de', 1, '2016-12-08 15:55:17', '2016-12-08 15:55:17')

  def destroy
    @abo_newsletter.destroy
---
DELETE FROM `abo_newsletters` WHERE `abo_newsletters`.`id` = 2

    def set_abo_newsletter
      @abo_newsletter = AboNewsletter.find(params[:id])
---
SELECT  `abo_newsletters`.* FROM `abo_newsletters` WHERE `abo_newsletters`.`id` = 2 LIMIT 1