app/controllers/c_events_controller.rb

  def index

  #  @events = CEvent.where(start: params[:start]..params[:end])

    @c_events = CEvent.where(room_id: params[:roomid])

    @json = []

    @c_events.each do |event|
---
SELECT `c_events`.* FROM `c_events` WHERE `c_events`.`room_id` IS NULL
SELECT `c_events`.* FROM `c_events`




    if @c_event.save
---
INSERT INTO `c_events` (`title`, `start`, `end`, `description`, `created_at`, `updated_at`, `room_id`, `minSize`, `maxSize`, `member`, `free`, `startLogin`, `endLogin`) VALUES ('Mit anmeldung', '2017-02-24 07:00:00', '2017-02-24 15:00:00', 'zum test', '2017-02-13 12:56:25', '2017-02-13 12:56:25', 1, 10, 30, 0, 1, '2017-02-13 07:00:00', '2017-02-22 17:00:00')

    def set_c_event

      @c_event = CEvent.find(params[:id])
---
SELECT  `c_events`.* FROM `c_events` WHERE `c_events`.`id` = 1 LIMIT 1