app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @room = params[:maxSize]
    if params[:weeks].to_i <= 0
      @startdateVa = params[:startDate]
      @hours = params[:hours]
#      @room = Room.find_by_size([params[:minSize]. params[:maxSize]])
      @roomplaning = Roomplaning.new
      @roomplaning.year = @startdateVa.to_date.strftime("%Y")
      @roomplaning.week = @startdateVa.cweek
      @day = @startdateVa.to_date.strftime("%a")
      case @day
        when "Mon"
          @roomplaning.monday = @startdateVa.to_date
        when "Tue"
          @roomplaning.tuesday = @startdateVa.to_date
        when "Wed"
          @roomplaning.wednesday = @startdateVa.to_date
        when "Thu"
          @roomplaning.thursday = @startdateVa.to_date
        when "Fri"
          @roomplaning.friday = @startdateVa.to_date
        else
      end

      @roomplaning.events = @event
      @event.publish = false
      if @roomplaning.save
---
INSERT INTO `events` (`name`, `description`, `minSize`, `maxSize`, `hours`, `weeks`, `endDate`, `startLoginDate`, `endLoginDate`, `created_at`, `updated_at`, `publish`) VALUES ('Test', 'Test', 10, 20, 1.0, 0, '2017-01-30', '2017-01-30 12:37:00', '2017-01-30 12:37:00', '2017-01-30 13:31:38', '2017-01-30 13:31:38', 0)
INSERT INTO `roomplanings` (`week`, `tuesday`, `created_at`, `updated_at`, `year`) VALUES (5, '2017-01-31 00:00:00', '2017-01-30 13:29:50', '2017-01-30 13:29:50', 2017)