app/controllers/members_controller.rb

  def index
    @members = Member.all
    puts(DateTime.now.utc)
    @events = CEvent.where(free: true).where('`c_events`.`startLogin` < ?', Time.now.utc).where('`c_events`.`endLogin` > ?', Time.now.utc)
    @rooms = Room.all
---
SELECT `members`.* FROM `members`
SELECT `c_events`.* FROM `c_events` WHERE `c_events`.`free` = 1 AND (startLogin <= '2017-02-13T00:00:00+00:00' AND endLogin >= '2017-02-13T00:00:00+00:00')
SELECT `rooms`.* FROM `rooms`

  def create
    @member = Member.new(member_params)

    respond_to do |format|

      if @member.save
---
INSERT INTO `members` (`gender`, `firstName`, `lastName`, `street`, `plz`, `place`, `job`, `phone`, `eMail`, `sleep`, `room`, `nameCompany`, `streetCompany`, `placeCompany`, `veggie`, `accept`, `event_id`, `created_at`, `updated_at`) VALUES ('Herr', 'Marian', 'Vennew', 'löhjlh', 'sdfj', 'lkj', 'lökhlh', '6754', 'hsdfasdf', 1, 'kein Zimmer', 'sdfsdf', 'assfsddf', 'sdfsdf', 'nein', 1, 8, '2017-02-13 09:02:03', '2017-02-13 09:02:03')

  def set_member
    @member = Member.find(params[:id])
---
SELECT  `members`.* FROM `members` WHERE `members`.`id` = 12 LIMIT 1

  def set_event
    @event = CEvent.find(params[:id])
---
SELECT  `c_events`.* FROM `c_events` WHERE `c_events`.`member_id` = 8 LIMIT 1