app/controllers/members_controller.rb

UPDATE `c_events` SET `member` = 1, `updated_at` = '2017-02-13 10:24:07' WHERE `c_events`.`id` = 8
---
  def create
    @member = Member.new(member_params)
    @event = CEvent.find(@member.event_id)
    respond_to do |format|
      if @member.save