app/controllers/newssystems_controller.rb

SELECT `newssystems`.* FROM `newssystems`
---
  def index
    @newssystems = Newssystem.all

INSERT INTO `newssystems` (`title`, `subTitle`, `story`, `created_at`, `updated_at`) VALUES ('ddsfsdf', 'lökssfjkl', 'lköjsdfiwweriowjddfnjksdiouweufjcnoiasdfjbisjdvuashvsd.f\r\nasdfiojasdiopfj', '2016-12-16 14:41:41', '2016-12-16 14:41:41')
---
  def create
    @newssystem = Newssystem.new(newssystem_params)


    respond_to do |format|

      if @newssystem.save

SELECT  `newssystems`.* FROM `newssystems` WHERE `newssystems`.`id` = 1 LIMIT 1
---
    def set_newssystem
      @newssystem = Newssystem.find(params[:id])