app/controllers/newssystems_controller.rb

  def index
    @newssystems = Newssystem.last(12)
---
SELECT  `newssystems`.* FROM `newssystems` ORDER BY `newssystems`.`id` DESC LIMIT 12