app/controllers/newsletters_controller.rb

  def index
    @newsletters = Newsletter.all
---
SELECT `newsletters`.* FROM `newsletters`

  def create
    @newsletter = Newsletter.new(newsletter_params)

    respond_to do |format|
      if @newsletter.save
        @aboNewsletters = AboNewsletter.all
---
INSERT INTO `newsletters` (`from`, `newsHeader`, `newsBody`, `newsFooter`, `appendix`, `created_at`, `updated_at`) VALUES ('neu', '<p>Title</p>', '<p style=\"text-align: left;\">Test sddsffdsddfsddfs<strong>sssssssfsdfsdf</strong></p>\r\n<p style=\"text-align: center;\"><strong>sdfsdf</strong></p>', '<p>@marian</p>', '', '2016-12-08 18:17:14', '2016-12-08 18:17:14')
SELECT  `newsletters`.* FROM `newsletters` ORDER BY `newsletters`.`id` DESC LIMIT 1
SELECT `abo_newsletters`.* FROM `abo_newsletters`

    def set_newsletter
      @newsletter = Newsletter.find(params[:id])
---
SELECT  `newsletters`.* FROM `newsletters` WHERE `newsletters`.`id` = 0 LIMIT 1