app/controllers/news_controller.rb

SELECT  `news`.* FROM `news` ORDER BY `news`.`id` DESC LIMIT 12
---
  def index
    @news = News.last(12)

INSERT INTO `news` (`title`, `subTitle`, `story`, `created_at`, `updated_at`) VALUES ('Jetzt auf Facebook', '', 'dsfjkldsjfkljdsfkljskldfjklfjasdfkbckbacdsbjckjbdsjkcbjdsklbjfioweruoiewhfhvbjkxcbvuiwhrfbkjbxcuivbwehfwbejvbjkxvbuiwebfbdsjbvvuisabuiewbrfbhbwiubuicbvabewuifbahbsfbdfkjb', '2017-02-20 20:02:54', '2017-02-20 20:02:54')
---
  def create
    @news = News.new(news_params)

    respond_to do |format|
      if @news.save

UPDATE `news` SET `story` = 'dsfjklds jfkljdsfkljskldf jklfjasdfkbckbac dsbjckjbdsjk cbjdsklbjfio weruoiewhf hvbjkx  cbvuiwhrfbkjbxcuivb wehfwbejvbjk xvbuiwebfbdsjb vvuisabuiewb rfbhb wiubuicb vabewuifb ahbsfbdfkjb ', `updated_at` = '2017-02-20 22:37:19' WHERE `news`.`id` = 1
---
  def update
    respond_to do |format|
      if @news.update(news_params)

SELECT  `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1
---
    def set_news
      @news = News.find(params[:id])