app/controllers/roomplanings_controller.rb

  def index
    @roomplanings = Roomplaning.all
---
SELECT `roomplanings`.* FROM `roomplanings`