app/controllers/rooms_controller.rb

SELECT `rooms`.* FROM `rooms`
---
  def index
   # @rooms = Room.all
    respond_to do |format|
      format.json { render json: Room.all}

SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = NULL LIMIT 1
---
    def set_room
      @room = Room.find(params[:id])

SELECT `c_events`.* FROM `c_events` WHERE `c_events`.`room_id` = 1
---
    def set_event
      @event = CEvent.find(params[:id])